import { ISlideState } from "../interfaces/interfaces";

export const slideInfo: ISlideState[] = [
  {
    id: 1,
    name: 'Литература',
    startDate: '1992',
    endDate: '1997',
    numForCircle: 5,
    events: [
      {
        date: '1992',
        event: 'Публикация "Инструкции к действию" Паланика стала литературным феноменом.'
      },
      {
        date: '1993',
        event: 'Артур Голден выпустил "Бескрайние просторы океана", покоривший читателей.'
      },
      {
        date: '1994',
        event: ' Хосе Сарамаго получил Нобелевскую премию за "Слепоту".'
      },
      {
        date: '1995',
        event: 'Мичио Каку опубликовал "Гиперпространство", вдохновившее научную литературу.'
      },
      {
        date: '1996',
        event: 'Джон Гришэм продолжил успех с "Шантажистом", бестселлером года.'
      },
      {
        date: '1997',
        event: 'Начало серии книг о Гарри Поттере Дж. К. Роулинг.'
      }
    ]
  },
  {
    id: 2,
    name: 'Наука',
    startDate: '2015',
    endDate: '2022',
    numForCircle: 6,
    events: [
      {
        date: '2015',
        event: 'Обнаружение гравитационных волн подтвердило теорию Эйнштейна.'
      },
      {
        date: '2016',
        event: ' Китай запустил мозаичный спутник для расширения квантовой связи.'
      },
      {
        date: '2022',
        event: 'Запуск телескопа James Webb обещает революцию в астрономии.'
      }
    ]
  },
  {
    id: 3,
    name: 'Кино',
    startDate: '1987',
    endDate: '1991',
    numForCircle: 7,
    events: [
      {
        date: '1987',
        event: '"Холодное сердце" установило новый стандарт в анимационном кино.'
      },
      {
        date: '1988',
        event: ' "Доживем до понедельника" (1988) Вячеслава Крюкова стал культовым фильмом.'
      },
      {
        date: '1989',
        event: 'Тим Бёртон поразил зрителей "Бэтменом", переосмыслив героя комиксов.'
      },
      {
        date: '1990',
        event: '"Танцующий с волками" Кевина Костнера стал кинематографическим триумфом.'
      },
      {
        date: '1991',
        event: '"Молчание ягнят" заслуженно получил пять Оскаров, в том числе за лучший фильм.'
      }
    ]
  },
  {
    id: 4,
    name: 'Литература',
    startDate: '1992',
    endDate: '1997',
    numForCircle: 8,
    events: [
      {
        date: '1992',
        event: 'Публикация "Инструкции к действию" Паланика стала литературным феноменом.'
      },
      {
        date: '1993',
        event: 'Артур Голден выпустил "Бескрайние просторы океана", покоривший читателей.'
      },
      {
        date: '1994',
        event: ' Хосе Сарамаго получил Нобелевскую премию за "Слепоту".'
      },
      {
        date: '1995',
        event: 'Мичио Каку опубликовал "Гиперпространство", вдохновившее научную литературу.'
      },
      {
        date: '1996',
        event: 'Джон Гришэм продолжил успех с "Шантажистом", бестселлером года.'
      },
      {
        date: '1997',
        event: 'Начало серии книг о Гарри Поттере Дж. К. Роулинг.'
      }
    ]
  },
  {
    id: 5,
    name: 'Наука',
    startDate: '2015',
    endDate: '2022',
    numForCircle: 9,
    events: [
      {
        date: '2015',
        event: 'Обнаружение гравитационных волн подтвердило теорию Эйнштейна.'
      },
      {
        date: '2016',
        event: ' Китай запустил мозаичный спутник для расширения квантовой связи.'
      },
      {
        date: '2022',
        event: 'Запуск телескопа James Webb обещает революцию в астрономии.'
      }
    ]
  },
  {
    id: 6,
    name: 'Кино',
    startDate: '1987',
    endDate: '1991',
    numForCircle: 10,
    events: [
      {
        date: '1987',
        event: '"Холодное сердце" установило новый стандарт в анимационном кино.'
      },
      {
        date: '1988',
        event: ' "Доживем до понедельника" (1988) Вячеслава Крюкова стал культовым фильмом.'
      },
      {
        date: '1989',
        event: 'Тим Бёртон поразил зрителей "Бэтменом", переосмыслив героя комиксов.'
      },
      {
        date: '1990',
        event: '"Танцующий с волками" Кевина Костнера стал кинематографическим триумфом.'
      },
      {
        date: '1991',
        event: '"Молчание ягнят" заслуженно получил пять Оскаров, в том числе за лучший фильм.'
      }
    ]
  },
];

export const numPoints: number = 6;
export const radius: number = 265;
export const centerX: number = 262;
export const centerY: number = 262;