import { ISlideState } from "../interfaces/interfaces";

export const slideInfo: ISlideState[] = [
  {
    id: 1,
    name: 'Литература',
    startDate: '1992',
    endDate: '1997',
    numForCircle: 5,
    events: [
      {
        date: '1992',
        event: 'Нобелевскую премию по литературе в 1992 году получил драматург и поэт Дерек Уолкотт из Сент-Люсии.'
      },
      {
        date: '1992',
        event: 'Выход романа "Красное и чёрное" Стивена Кинга: Этот роман стал одним из самых известных произведений Стивена Кинга.'
      },
      {
        date: '1995',
        event: 'Смерть Исидора Исуса: Исидор Исус, популярный писатель и журналист, ушел из жизни в 1995 году.'
      },
      {
        date: '1996',
        event: 'Выход романа "Инферно" Дэна Брауна: Этот бестселлер привлек внимание читателей по всему миру.'
      },
      {
        date: '1997',
        event: 'Начало серии книг о Гарри Поттере Дж. К. Роулинг.'
      },
      {
        date: '1997',
        event: 'Выход "Игры Эндера" Орсона Скотта Карда (1997): Этот научно-фантастический роман стал классикой жанра и принес популярность автору.'
      }
    ]
  },
  {
    id: 2,
    name: 'Наука',
    startDate: '2015',
    endDate: '2022',
    numForCircle: 6,
    events: [
      {
        date: '2015',
        event: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
      },
      {
        date: '2016',
        event: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
      },
      {
        date: '2017',
        event: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
      }
    ]
  },
  {
    id: 3,
    name: 'Кино',
    startDate: '1987',
    endDate: '1991',
    numForCircle: 7,
    events: [
      {
        date: '1987',
        event: '"Тайны Лос-Анджелеса": Фильм, режиссированный и снятый Кертисом Хэнсоном, стал культовым представителем жанра нуар.'
      },
      {
        date: '1989',
        event: '"Достучаться до небес": Этот немецкий фильм режиссера Тиля Швайгера стал международным хитом.'
      },
      {
        date: '1990',
        event: '"Танцующий с волками": Эпический фильм Кевина Костнера выиграл семь премий "Оскар".'
      },
      {
        date: '1990',
        event: '"Крёстный отец 3": Режиссер Фрэнсис Форд Коппола завершил свою знаменитую трилогию "Крёстный отец" третьей частью.'
      },
      {
        date: '1988',
        event: '"Тихий океан, скрытый лес": Этот японский фильм режиссера Хайдэо Миядзаки также получил высокую оценку и внимание за границей.'
      }
    ]
  },
  {
    id: 4,
    name: 'Литература',
    startDate: '1992',
    endDate: '1997',
    numForCircle: 8,
    events: [
      {
        date: '1992',
        event: 'Нобелевскую премию по литературе в 1992 году получил драматург и поэт Дерек Уолкотт из Сент-Люсии.'
      },
      {
        date: '1992',
        event: 'Выход романа "Красное и чёрное" Стивена Кинга: Этот роман стал одним из самых известных произведений Стивена Кинга.'
      },
      {
        date: '1995',
        event: 'Смерть Исидора Исуса: Исидор Исус, популярный писатель и журналист, ушел из жизни в 1995 году.'
      },
      {
        date: '1996',
        event: 'Выход романа "Инферно" Дэна Брауна: Этот бестселлер привлек внимание читателей по всему миру.'
      },
      {
        date: '1997',
        event: 'Начало серии книг о Гарри Поттере Дж. К. Роулинг.'
      },
      {
        date: '1997',
        event: 'Выход "Игры Эндера" Орсона Скотта Карда (1997): Этот научно-фантастический роман стал классикой жанра и принес популярность автору.'
      }
    ]
  },
  {
    id: 5,
    name: 'Наука',
    startDate: '2015',
    endDate: '2022',
    numForCircle: 9,
    events: [
      {
        date: '2015',
        event: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
      },
      {
        date: '2016',
        event: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
      },
      {
        date: '2017',
        event: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
      }
    ]
  },
  {
    id: 6,
    name: 'Кино',
    startDate: '1987',
    endDate: '1991',
    numForCircle: 10,
    events: [
      {
        date: '1987',
        event: '"Тайны Лос-Анджелеса": Фильм, режиссированный и снятый Кертисом Хэнсоном, стал культовым представителем жанра нуар.'
      },
      {
        date: '1989',
        event: '"Достучаться до небес": Этот немецкий фильм режиссера Тиля Швайгера стал международным хитом.'
      },
      {
        date: '1990',
        event: '"Танцующий с волками": Эпический фильм Кевина Костнера выиграл семь премий "Оскар".'
      },
      {
        date: '1990',
        event: '"Крёстный отец 3": Режиссер Фрэнсис Форд Коппола завершил свою знаменитую трилогию "Крёстный отец" третьей частью.'
      },
      {
        date: '1988',
        event: '"Тихий океан, скрытый лес": Этот японский фильм режиссера Хайдэо Миядзаки также получил высокую оценку и внимание за границей.'
      }
    ]
  },
];

export const numPoints: number = 6;
export const radius: number = 265;
export const centerX: number = 262;
export const centerY: number = 262;