export const slideInfo = [
  {
    id: 1,
    name: 'Литература',
    startDate: '1992',
    endDate: '1997',
    events: [
      {
        date: '1992',
        event: 'Присуждение Нобелевской премии по литературе 1992 года: Нобелевскую премию по литературе в 1992 году получил драматург и поэт Дерек Уолкотт из Сент-Люсии.'
      },
      {
        date: '1992',
        event: 'Выход романа "Красное и чёрное" Стивена Кинга (1992): Этот роман стал одним из самых известных произведений Стивена Кинга и получил высокую оценку как читателей, так и критиков.'
      },
      {
        date: '1995',
        event: 'Смерть Исидора Исуса в 1995 году: Исидор Исус, популярный писатель и журналист, ушел из жизни в 1995 году. Его творчество оказало значительное влияние на латиноамериканскую литературу.'
      },
      {
        date: '1996',
        event: 'Выход романа "Инферно" Дэна Брауна (1996): Этот бестселлер привлек внимание читателей по всему миру и стал частью популярной серии романов о Роберте Лэнгдоне.'
      },
      {
        date: '1997',
        event: 'Начало серии книг о Гарри Поттере Дж. К. Роулинг (1997): В 1997 году был выпущен первый роман о Гарри Поттере, "Гарри Поттер и философский камень", который принес огромный успех и популярность автору.'
      },
      {
        date: '1997',
        event: 'Выход "Игры Эндера" Орсона Скотта Карда (1997): Этот научно-фантастический роман стал классикой жанра и принес популярность Орсону Скотту Карду, выделяя его как важного автора в области научной фантастики.'
      }
    ]
  },
  {
    id: 2,
    name: 'Наука',
    startDate: '2015',
    endDate: '2022',
    events: [
      {
        date: '2015',
        event: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
      },
      {
        date: '2016',
        event: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
      },
      {
        date: '2017',
        event: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
      }
    ]
  },
  {
    id: 3,
    name: 'Кино',
    startDate: '1987',
    endDate: '1991',
    events: [
      {
        date: '1987',
        event: '"Тайны Лос-Анджелеса" (1987): Фильм, режиссированный и снятый Кертисом Хэнсоном, стал культовым представителем жанра нуар и оказал влияние на многие последующие криминальные фильмы.'
      },
      {
        date: '1989',
        event: '"Достучаться до небес" (1989): Этот немецкий фильм режиссера Тиля Швайгера стал международным хитом и значительно повысил известность немецкого кинематографа.'
      },
      {
        date: '1985',
        event: 'Основание студии Studio Ghibli (1985): Хайао Миядзаки, Исао Такахата и их коллеги основали Studio Ghibli в 1985 году, что привело к созданию ряда выдающихся японских анимационных фильмов, таких как "Принцесса Мононоке" и "Ходячий замок".'
      },
      {
        date: '1990',
        event: '"Танцующий с волками" (1990): Эпический фильм Кевина Костнера выиграл семь премий "Оскар" и считается одним из важных событий в истории западного кинематографа.'
      },
      {
        date: '1990',
        event: '"Крёстный отец 3" (1990): Режиссер Фрэнсис Форд Коппола завершил свою знаменитую трилогию "Крёстный отец" третьей частью, предложив новый эпилог и завершение истории семьи Корлеоне.'
      },
      {
        date: '1988',
        event: '"Тихий океан, скрытый лес" (1988): Этот японский фильм режиссера Хайдэо Миядзаки также получил высокую оценку и внимание за границей, став важным событием в мире анимации.'
      }
    ]
  },
];

export const numPoints = 3;
export const radius = 265;
export const centerX = 262;
export const centerY = 262;